cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'

cask 'java8'

brew 'git'
brew 'node'
brew 'python'
brew 'scala'
brew 'maven'
brew 'bazel'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'vim'
brew 'go'
brew 'grc'
brew 'jq'
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'unrar'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'ffmpeg'
brew 'hub'
brew 'kubernetes-cli'
brew 'awscli'
brew 'fd'

cask 'atom'
cask 'google-chrome'
cask 'slack'
cask 'tunnelbear'
cask 'intellij-idea'
cask 'spotify'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'fantastical'
cask 'yemuzip'
cask 'macdown'
cask 'iterm2'
cask 'adobe-creative-cloud'
cask 'dashlane'
cask 'blue-jeans'

# Quick look plugins - https://github.com/sindresorhus/quick-look-plugins
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlprettypatch'
cask 'qlstephen'
